<template>
    <transition name="slide">
      <div class="user-center">
        <p class="title">免责声明</p>
        <p>此音乐系统纯属个人学习之用，本项目所有歌曲来源于QQ音乐官网 版权归QQ音乐所有！</p>
        <p>为什么要开发此网站</p>
        <p>
          由于某些不可描述的原因和一些地域限制。让我这没有音乐就没法活的小前端完全不能忍受。宗爱QQ音乐的电台播放。
          能够随机的惊喜。所以搭建了此网站。只为满足自身喜好。只为每天能听到熟悉的声音和熟悉的味道。
        </p>
        <p style="color: #ffcd32">
          本想偷个懒拉了2个项目但是都不太满意。故发扬了毛爷爷的自己动手 丰衣足食参照了其他类似项目的UI(勿怪我的审美有限)
          本项目能连续运行到天荒地老不卡顿（不知道是我的打开方式不对的原因，其他类似项目在运行3个小时后页面极卡乃至浏览器奔溃）
        </p>
        <p>
          此示例网站 是小水管网站(还是因为穷)受不了各位大汉的使劲蹂躏，请怜惜我！
          如有喜欢的 请构建服务 自行搭建。
          由于时间和自身原因(还是因为懒)有几个模块为完成 和 做得比较精简。请喜好者自行优化、扩展。
          文件功能都有详细描述和归类。
        </p>
        <p>
          如有疑问 请致电 1172350020@qq.com
        </p>
      </div>
    </transition>
</template>

<script src="./user.js"></script>

<style lang="stylus" scoped src="./user.styl"></style>